[
    {
        "name": "<span style='color:#EEEE9B'>[Black March]</span> Bam",
        "title": "The Boy Who Chases After Light",
        "image": "/images/2.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/yellow.png",
        "class": "/images/classes/support.png",
        "type": "/images/types/magic.png",
        "history": "Twenty-Fifth Bam, a boy who grew up in the lonely darkness of a cave.<br><br>One day, his only friend Rachel vanished into the Tower in search of the stars, and Bam followed her.<br><br>However, instead of Rachel, he found unfamiliar faces and crueld tests waiting for him<br><br>While he barely overcomes the first tests with the help of those around him, he gradually grows with his new teammates who help him develop his talent and convictions.<br><br>And the moment he reaches for the light he dreamed of finding, his whole world will change.",
        "color": "#EEEE9B",
        "titles": ["Black March, Ignited","Progidy Wave Controller","Reverse Flow Control","Main Character"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions":["Bam Ignites the Black March, dealing 620% of his ATK as DMG to the enemy with the highest ATK. In addition, he Stuns the enemy for 3s and decreases their Energy by 400. Bam's next 5 basic attacks are enhanced to Black March Slashes, increasing his ATK coefficient by 210% and decreasing the target's Energy by 40. Bam becomes immune to status effects while the Black March is ignited.",
        "Bam becomes immune to Jolt and spends 3s gathering the Tower's shinsu, then infuses it into the ally with the highest ATK. The infused ally recovers 400 Energy, their ATK increases by 80%, and their DEF increases by 80% until the end of the battle.",
        "Bam concentrates shinsu in his hand and fires it at the enemy to cause reverse flow control, dealing 700% DMG and Stopping their movement for 3s.",
        "Bam subconsciously emanates shinsu every 5s after the start of the battle, restoring the Energy of nearby allies by 200. Bam becomes distressed when an ally (not including himself) dies for the first time in battle, causing him to lose control of his shinsu and deal 400% of his ATK as DMG to nearby enemies and Stop their movement for 3s."]
    },
    {
        "name": "<span style='color:#F47174'>[Thorn]</span> Jue Viole Grace",
        "title": "The FUG god",
        "image": "/images/14.png",
        "rarity": "/images/rarity/ssrplus.png",
        "element": "/images/elements/red.png",
        "class": "/images/classes/ranged.png",
        "type": "/images/types/magic.png",
        "history": "",
        "color": "#F47174",
        "titles": ["","","",""],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["",
        "",
        "",
        ""]
    },
    {
        "name": "<span style='color:#B695C0'>[Strategist]</span> Khun Aguero",
        "title": "The Cynical Light Bearer",
        "image": "/images/1.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/purple.png",
        "class": "/images/classes/support.png",
        "type": "/images/types/magic.png",
        "history": "A descendant of one of the Ten Great Families, the Khun family. He began to climb the Tower with aspirations of becoming the head of this family.<br><br>Due to some internal familial conflict, he was cast out as an 'abandoned son.'<br><br>He trusted no one, and was cold, calculated, and efficient, utilizing every means at his disposal to achieve his goals. However, he gradually begins to grow as a person as he learns about true friendship through his first teammates, Twenty-Fifth Bam and Rak Wraithraiser.<br><br>He is mainly responsible for the team's strategic planning, but not because he's an unskilled combatant- he does it because he 'likes to be in control'. In fact, he seems to excel in hand-to-hand and close-quarters combat.",
        "color": "#B695C0",
        "titles": ["Mystery Sphere","Manbarondena","Quadruple Barrier","Weapon Boost"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Khun summons a Mystery Sphere above the area where the enemies are most concentrated for 5s, dealing 160% of his ATK as DMG every second and Paralyzing enemies for 1s. Enemies hit by the attack have their DEF decreased by 40% for 1s.",
        "Manbarondenna swallows the enemy with the highest ATK, dealing 100% of Khun's ATK as DMG and Sealing the enemy for 8s. The target is Knocked Down for 2s upon being released from the Seal. Activates only when there are 2 or more enemies.",
        "Khun summons four Lighthouses to create a barrier that lasts for 5s, equal to 400% of his ATK, for the ally with the lowest HP. The barrier grants the ally Status Effect Immunity and restores their Energy by 40 every second for the duration it is active.",
        "Khun increases the ATK of Purple Element allies by 32% at the start of the battle."]
    },
    {
        "name": "<span style='color:#EEEE9B'>[Hunter]</span> Rak",
        "title": "A Spear Bearer on the Prowl",
        "image": "/images/3.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/yellow.png",
        "class": "/images/classes/tank.png",
        "type": "/images/types/physical.png",
        "history": "A giant three-meter-tall crocodile monster.<br><br>He calls the other Regulars 'turtles', and declared that he is there to hunt them. But while trying to 'hunt' Twenty-Fifth Bam on the Floor of Tests, Khun's ploy forced him to become teammates with them. Since then, the three have been through a lot together, and have beocme good friend. Despite his gruff demeanor, he is a reliable teammate that treasures his friends more than anything else.",
        "color": "#EEEE9B",
        "titles": ["Time to Hunt","Hide Behind Me, Turtle","Wake up, Turtle","Leader Rak"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Rak runs toward the enemy with the highest ATK, swinging his spear in a fan-shaped area to deal 620% of his ATK as DMG, Knocking Back the enemies to the edge of the battlefield. He deals 820% of his ATK as DMG to targets with HP below 30%.",
        "Rak dashes toward the ally with the lowest HP to deal 620% of his ATK as DMG to nearby enemies and Knock them Back. In addition, Rak increases the Physical and Magic Resistance of both himself and the target ally by 80% for 5s.",
        "Rak takes chocolate bars out of his bag and throws them at nearby allies to recover their HP by 200% of his ATK every second for 3s and increase their DEF by 100% for 5s.",
        "Rak's Physical Resistance increases by 8% for every ally nearby. The effect is greatly enhanced if all allies are near him, increasing his Physical Resistance by an additional 32%. This skill changes Rak's basic attacks into ranged attacks and increases his ATK by 200% if there are no enemies nearby."]
    },
    {
        "name": "<span style='color:#B695C0'>[Princess]</span> Endorsi",
        "title": "The Wings in Flight",
        "image": "/images/4.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/purple.png",
        "class": "/images/classes/assassin.png",
        "type": "/images/types/physical.png",
        "history": "A Princess of Zahard, an adopted daughter to the king of the Tower.<br><br>She appeared on the Floor of Test after annihilating everyone but the members of her own team. Although the harsh training she underwent to become one of Zahard's Princesses forced her to adapt to the Tower's rules from an early age, she gradually begins to open up and learn empathy after prolonged interactions and quarrels with Twenty-Fifth Bam, Anaak Zahard, and her other new friends.<br><br>Perhaps because she is forbidden from dating and pursuing marriage, she seems to have an idealistic perspective on the concept of love.",
        "color": "#B695C0",
        "titles": ["Chiffon Sword","Compression Needle","Reckless Princess","Bong Bong Output"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Endorsi jumps toward the enemy with Bong Bong, dealing 400% of her ATK as DMG and Knocking them Down for 2s. Endorse becomes Invincible while using this skill.",
        "Endorsi pierces through nearby enemies, dealing 200% of her ATK as DMG 3 times. Pierced enemies Bleed, taking 120% of Endorsi's ATK as DMG every second for 5s.",
        "Endorsi flies with Bong Bong, dealing 200% of her ATK as DMG to the enemy with the lowest DEF in the back row. The target is Knocked Down for 2s and cannot recover Energy for 5s. Endorsi becomes immune to status effects while using this skill.",
        "If Endorsi is the first to take fatal damage in battle, she Teleports back to her starting position with Bong Bong to recover 12% of her Max HP every second for 3s."]
    },
    {
        "name": "<span style='color:#ACD1AF'>[Red Rose]</span> Yuri Jahad",
        "title": "A Growling Believer",
        "image": "/images/5.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/green.png",
        "class": "/images/classes/tank.png",
        "type": "/images/types/physical.png",
        "history": "A Princess of Zahard who was given the Black March by King Zahard. She is a High Ranked and a descendant of one of the Ten Great Families: the Ha Family.<br><br>After hearing rumors of an Irregular who opened the door to the Tower himself, Yuri inmediately headed to the lowest floor for the sole reason of getting some free entertainment. She was briefly disappointed after first seeing Twenty-Fifth Bam, but lent him the Black March, intrigued by his willingness to take on an unfair test.<br><br>After Twenty-Fifth Bam passed the test, she becomes a dependable ally in Bam's quest to climb the Tower.<br><br>She is infamous for her short temper, but she has many allies who follow her for her upright convictions. She is also known as the 'Black Snakehead'",
        "color": "#ACD1AF",
        "titles": ["Rose Shower","Red Velvet Sword","Nuclear Punch","Shinsu Bubble"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Yuri jumps into the air in an Invincible state and fires a blast of Rose Shinsu, dealing 400% of her ATK as DMG to enemies in range and jolting them. She then creates an area of Rose Shinsu which deals 80% of her ATK as DMG every second for 5s and decreases the enemy's Swiftness by 40. In addition, this skill Locks the enemy for 6s if they stay in the Rose Shinsu Area for more than 3s.",
        "Yuri jumps over to the area where the enemies are most concentrated, dealing 620% of her ATK as DMG to enemies in range and Knocking them Down for 2s. She becomes Immune to status effects while using this skill.",
        "Yuri deals 400% of her ATK as DMG to enemies in a straight line and sends them Airborne for 2s. In addition, Yuri's DEF increases by 120% for 10s.",
        "Every time Yuri uses a skill, she creates a Shinsu Bubble barrier equal to 400% of her ATK that lasts for 3s."]
    },
    {
        "name": "<span style='color:#F47174'>[Green April]</span> Anaak Jahad",
        "title": "The Thorned Jade",
        "image": "/images/6.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/red.png",
        "class": "/images/classes/warrior.png",
        "type": "/images/types/physical.png",
        "history": "The wielder of the Green April, determined to climb the Tower of revenge.<br><br>She is one of the most talented Regulars, but she is often so reckless that even her friends can't hold her back. She tamed up with Shibisu and Hatz. Due to her strange friendship with Endorsi Zahard, and the unexpected familial bond they discovered after being placed in the same testing group, Anaak finds a reason to climb the Tower for something other than revenge.<br><br>It is said that a Ranked with the same name has already climber the Tower, but they went missing long ago.",
        "color": "#F47174",
        "titles": ["Green April, Ignition!","Run","We'll See About That","Half Princess"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Anaak Ignites the Green April, sending a giant Needle towards the enemy, dealing 620% of her ATK as DMG to the target and nearby enemies and Knocking them Down for 3s. The ground then explodes around the target area, dealing 620% of her ATK as DMG to enemies in range and sending them Airborne for 2s.",
        "Anak moves to the enemy with the highest ATK and slams the ground with her Hook, dealing 620% of her ATK as DMG and sending them Airborne for 3s. Anak becomes immune to status effects while moving with her Hook.",
        "Anak strengthens her body with shinsu and charges at the enemy with the highest ATK, dealing 620% of her ATK as DMG and Knocking them Down for 3s. If the enemy is Knocked Down by this attack, Anak grabs them and throws them behind her, dealing 620% of her ATK as DMG. Anaak becomes immune to status effects while throwing the enemy.",
        "Anaak ignores DMg that is 50% or lower her Max HP once. (Cooldwon: 6s)"]
    },
    {
        "name": "<span style='color:#F47174'>[Destined Path]</span> Hwaryun",
        "title": "Red Witch",
        "image": "/images/7.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/red.png",
        "class": "/images/classes/support.png",
        "type": "/images/types/physical.png",
        "history": "A Guide.<br><br>She loses her right eye to Twenty-Fifth Bam while trying to attack Rachel in the Crown Game. After a complicated series of events, she starts climbing the Tower with Bam. She always leads her group to the most advantageous outcomes with rational and cool-headed judgment. However, her dispassionate demeanor and strange goals make her appear to have many secrets.<br><br>She is a Red Witch and a Guide of the Tower.",
        "color": "#F47174",
        "titles": ["Premptive Strike","Delay Tactic","Guide's Guidance","Reveal Weakpoint"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Hwaryun jumps toward the Weakpoint enemy to deal 800% of her ATK as DMG. She swings her staff to deal 400% of her ATK as DMG to other enemies and Knocks them Back. She then increases nearby allies' Swiftness by 40 and their ATK by 40% for 12s, then creates a barrier equal to 800% of ATK that lasts 8s.",
        "Hwaryun throws her staff, dealing 800% of her ATK as DMG and decreasing the Swiftness of enemies in its path by 40 for 10s. If the target is a Weakpoint enemy, they are Stunned for 2s.",
        "Hwaryun carves a path toward the Weakpoint enemy. She then orders all teammates to quickly move to the Weakpoint enemy and attack them while the path is active. The path lasts for 10s and increases the Swiftness of allies on it by 80.",
        "Hwaryun finds the enemy with the highest ATK at the start of the battle and marks them as Weakpoint. She increases her allies' ATK by 40% and Critical Hit Rate by 40% when attacking the Weakpoint enemy. When the Weakpoint enemy is defeated, all teammates' Energy increases by 400 and Hwaryun finds a new Weakpoint target."]
    },
    {
        "name": "<span style='color:#B695C0'>[Young Girl]</span> Rachel",
        "title": "The Star-chaser",
        "image": "/images/8.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/purple.png",
        "class": "/images/classes/mage.png",
        "type": "/images/types/magic.png",
        "history": "The girl Twenty-Fifth Bam is chasing after.<br><br>She had always dreamt of climbing the Tower to see the stars. By entering the Tower, she hoped she would finally get her wish, but she soon discovers that Bam is the chosen one, not her.<br><br>In the face of this harsh reality and the cold treatment she often receives from others, Rachel continues to climb the Tower by embracing her resentment for the boy she believes took everything from her.",
        "color": "#B695C0",
        "titles": ["Lighthouse Compression Release","Space Compression","Self-proclaimed Heroine","Suspicious Spell"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Rachel summons a compressed Lighthouse above the enemy and drops it to deal 200% of her ATK as DMG and Knocks the enemy Down for 2s. The compressed Lighthouse decompresses over 2s, growing in size every 0.5s and increasing her ATK by 100% each time. <br><br>However, if Rachel is struck by a Status Effect Attack, the Lighthouse stops decompressing and drops immediately.",
        "Rachel summons a Lighthouse above the area where enemies are most concentrated, dealing 200% of her ATK as DMG every 0.5s for 2s. She then pulls the enemies towards the Lighthouse. Rachel's DEF increases by 8% for 10s for each enemy that takes damage.",
        "Rachel steals 100 Energy from a Linked ally. She then deals 620% of her ATK as DMG to enemies around the ally and Stuns them for 2s. If there is no Linked ally, Rachel deals 620% of ATK as DMG to the closest enemy and steals 100 Energy from them.",
        "Rachel Links with the ally with the highest DEF at the start of the battle, redirecting 50% of DMG she takes to that ally. Rachel's DEF increases by 40% while the Link is active."]
    },
    {
        "name": "<span style='color:#EEEE9B'>[Dual Swords]</span> Hatz",
        "title": "The Unbreakable Sword",
        "image": "/images/10.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/yellow.png",
        "class": "/images/classes/warrior.png",
        "type": "/images/types/physical.png",
        "history": "A duel-wielding swordsman.<br><br>While he comes off as serious and cold-hearted with his stern tone and stubborn behavior, he trusts his teammates more than anyone else. There are times when he unintentionally falls into danger because the priorities loyalty.<br><br>He is diligent, and always trains harder when he notices his skills falling behind.<br><br>Among the E-Rank Regulars beyond the 20th Floor, he is recognized as evenly-matched with Endorsi and Anaak Zahard.",
        "color": "#EEEE9B",
        "titles": ["White Wave: Single Slash Annihilation","Ghost Fish Wheel Dance: Single Annihilation","Highest & Lowest Flying Swords","Strict Training"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Hatz runs toward the enemy to slash them in a fan-shaped area, dealing 1,020% of his ATK as a guaranteed Critical Hit and Knocking them Back.",
        "Hatz strengthens his two-handed grip and slashes his sword at the enemies in a straight line. The strike deals 620% of his ATK as a guaranteed Critical Hit and Jolts them.",
        "Using both his swords for one attack, Hatz employs the Highest Flying Sword to block basic attacks and uses the Lowest Flying Sword to deal 400% of his ATK as DMG to nearby enemies.<br><br>Hatz's basic attack DMG increases by 300% for 10s after using this skill.",
        "Hatz sees right through the enemy with a sharp gaze at the start of the battle, increasing his Critical Hit Rate by 16%. His Swiftness increases by 40 for 5s and he recovers 8% of his Max HP upon landing a Critical Hit."]
    },
    {
        "name": "<span style='color:#ACD1AF'>[Insightful One]</span> Laure",
        "title": "The Sleeping Wave Controller",
        "image": "/images/11.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/green.png",
        "class": "/images/classes/mage.png",
        "type": "/images/types/magic.png",
        "history": "An odd Regular who always carries pillows and blankets. He can fall asleep anytime, anywhere.<br><br>The only way to get him to do anything is by taking his pillows and blankets, or finding some other way of keeping him awake.<br><br>As a member of the Eurasia Family, one of the Great Families, he has an extraordinary talent for controlling Shinsu and teaches Twenty-Fifth Bam how to make a baang with Shinsu.<br><br>He has a laid-back and indifferent personality, but he can get things done when necessary.",
        "color": "#ACD1AF",
        "titles": ["Cry of Piercing Water","Close-Range Shinsu Manipulation Technique","Shinsu Shield","Beauty Sleep"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Laure swings a giant shinsu sickle to deal 900% of his ATK as DMG to nearby enemies, pulling them into the center. He then jumps to the back of the battlefield.",
        "Laure dashes to the area where the enemies are most concentrated, dealing 800% of his ATK as DMG and Silencing the enemies in range for 4s.",
        "Laure creates a Status Effect Immunity barrier equal to 2,000% of his ATK and falls asleep for 4s. Lauren wakes up immediately if he takes 1 DMG or more while sleeping.",
        "Laure recovers 200 Energy every second while asleep. His Attack is increased by 160% for 10s upon waking up."]
    },
    {
        "name": "<span style='color:#EEEE9B'>[Deadly Martial Arts]</span> Shibisu",
        "title": "The Scout Leader",
        "image": "/images/12.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/yellow.png",
        "class": "/images/classes/support.png",
        "type": "/images/types/physical.png",
        "history": "A sociable and intelligent Scout.<br><br>With a friendly face and welcoming personality, he gets along well with everyone and serves as a catalyst for getting people to work together.When his team is in danger, he thinks quickly and has the ability to create a plan that utilizes the team's strengths.<br><br>Although he is trusted by his colleagues for these reasons, he lacks combat ability and is often carried through tests by his teammates.",
        "color": "#EEEE9B",
        "titles": ["Targetting","Shinsu Bomb","One Inch Punch","Scrappy Underdog"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Shibisu decreases the Physical and Magic Resistance of the enemy with the lowest HP by 80% for 10s. He then commands all allies to attack the target. Shibisu recovers 100% Energy if the target is defeated by the attack.",
        "Shibisu throws a shinsu bomb toward the most concentrated area of enemies, dealing 600% of his ATK as DMG to enemies and decreasing Energy Recovery by 90% for 10s.",
        "Shibisu dashes towards the enemy to deal 900% of his ATK as DMG, Stunning them for 3s.",
        "Shibisu increases the ATK of Yellow Element Allies by 32% at the start of the battle."]
    },
    {
        "name": "<span style='color:#EEEE9B'>[Forever Prepping]</span> Wangnan Ja",
        "title": "The Quixotic Boy",
        "image": "/images/13.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/yellow.png",
        "class": "/images/classes/ranged.png",
        "type": "/images/types/magic.png",
        "history": "The self-proclaimed 'Future King of the Tower'<br><br>A young Regular who couldn't pass the 20th Floor, which is often referred to as the Eye of a Needle.Owing a huge debt to a loan shark due to testing fees, he believes this is the last chance to climb the Tower.<br><br>After meeting new teammates on the 20th Floor, he was able to get Viole to open up, give Miseng courage, and believed in Yihwa's ability, becoming the true leader of Team Sweet & Sour.<br><br>He can be cowardly at times, but he values loyalty and does not let evil slide.",
        "color": "#EEEE9B",
        "titles": ["Antimatter Bomb","Mad Dog","Shinsu Bomb/Gum Bomb","Path of the Prince"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Wangnan throws an antimatter bomb crafted in the Workshop to deal 180% of his ATK as a Critical Hit 8 times to enemies in the area.",
        "Wangnan lets out a powerful shout, increasing his Critical Hit Rate by 40% and his Critical DMG by 80% for 10s. If he is inflicted with Fear at any time during combat, he immediately removes it and activates this skill.",
        "Wangnan throws a shinsu bomb and a gum bomb at the same time, each dealing 400% of his ATK as DMG to enemies. He deals an additional 620% of his ATK as a Critical Hit to enemies hit by both bombs, Stunning them for 2s.",
        "Wangnan's Critical DMG increases by 16% for every Yellow element ally at the start of the battle. When taking fatal damage in battle for the first time, Wangnan is revived after 5s with 80% of his Max HP, and his ATK is increased by 80% until the end of the battle."]
    },
    {
        "name": "<span style='color:#93CAED'>[Tactician]</span> Lero Ro",
        "title": "The Explorer of Cruel Truths",
        "image": "/images/15.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/blue.png",
        "class": "/images/classes/support.png",
        "type": "/images/types/magic.png",
        "history": "One of the second-floor test admins and a Ranker with considerable skill.<br><br>He is a handsome, two-meter-tall blond and the instructor for the Light Bearer Position.<br><br>Although the manner in which he explains to the Regulars about those chosen by the Tower seems callous, he is actually the kindest and most righteous person on the test administration team.<br><br>After those tests, he begins to question the Tower's system and goes searching for answers.",
        "color": "#93CAED",
        "titles": ["Enhanced Lighthouse: Highly <br>Concentrated Shinsu Zone","Shinsu Wall","Advantage Rule","Weapon Boost Skill"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Lero Ro becomes immune to Jolt and focuses for 5s, then drops an enhanced Lighthouse to deal 800% of his ATK as DMG to enemies in range. In addition, he Jolts targets if their DEF is higher than his, and Stuns them for 3s if their DEF is lower. The Lighthouse creates a highly concentrated area of shinsu for 6s, decrasing the Swiftness of enemies in range by 48.",
        "When the enemy is near, Lero Ro summons a wall of shinsu to deal 620% of his ATK as DMG to nearby enemies, Knocking them Back. In addition, he decreases their Swiftness by 40 for 10s.",
        "Lero Ro scanes the battlefield and decreases all enemies' DEF by 40% for 10s. Enemies with decreased Swiftness see an additional 20% decrease to their DEF.",
        "Lero Ro increases Blue Element allies ATK by 32% at the start of the battle."]
    },
    {
        "name": "<span style='color:#B695C0'>[Lightning Spear]</span> Khun Mascheny",
        "title": "The Bloody Dawn of Civilization",
        "image": "/images/9.png",
        "rarity": "/images/rarity/ssrplus.png",
        "element": "/images/elements/purple.png",
        "class": "/images/classes/ranged.png",
        "type": "/images/types/magic.png",
        "history": "A Princess of Zahard who was given the Yellow May by King Zahard. She is a High Ranker from the Khun Family, one of the Great Families, and is the founder of the Mascheny-style Lightning Spear Arts.<br><br>She not only has excellent fighting ability, but also a strategic mind to understand the greater situation of a battle and turn the tide. Her cold expression and lofty attitude make many envious of her.<br><br>However, at heart, she is a war-crazed individual who finds excitement in blood and battle, and she finds the present peace in the Tower boring compared to ancient times.",
        "color": "#B695C0",
        "titles": ["Tres Cuernos","Trident","Lightning Field","Lightning Shinsu"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Mascheny gathers shinsu to create Tres Cuernos, then throws it to deal 900% of her ATK as DMG to the enemy, Stealing 50 of their swiftness for 8s. Mascheny becomes Invincible while using this skill.",
        "Mascheny enhances her basic attacks and increases her Swiftness by 40 for 8s. The ATK coefficient of Mascheny's basic attack increases by 40% and her basic attack transforms into a three-pronged piercing attack.",
        "Mascheny unleashes her Lightning Field for 10s, creating a barrier equal to 600% of her ATK. She deals 200% of her ATK as DMG every second to enemies inside the field. The concentrated shinsu explodes when the Lightning Field disappears, Paralyzing enemies in range for 1s.",
        "Mascheny attaches lightning shinsu to the enemy for 10s when she lands a basic attack. Her basic attack DMG increases by 80% against targets with lightning shinsu attached to them. In addition, her lightning shinsu explodes after 4 attacks, dealing 80% of her ATK as DMG to nearby enemies and Paralyzing the target for 1s."]
    },
    {
        "name": "<span style='color:#93CAED'>[Data]</span> Khun Mascheny",
        "title": "The Harbringer of War",
        "image": "/images/16.png",
        "rarity": "/images/rarity/ssrplus.png",
        "element": "/images/elements/blue.png",
        "class": "/images/classes/assassin.png",
        "type": "/images/types/magic.png",
        "history": "The data of Khun Mascheny Zahard, which was copied to the hidden floor when she climbed the Tower. She is one of the children which Khun Edahn's data is fond of.<br><br>",
        "color": "#93CAED",
        "titles": ["Great Spear of Dawn","Lightning Spear","Discharge","Front Row - Lightning Pill"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Data Mascheny becomes Invincible, Teleports to the enemy with the highest ATK, then slams the Great Spear of Dawn into the ground to decrease the Magic Resistance of enemies hit by 20% for 10s and deal 240% of her ATK as DMG 5 times. The final attack causes a giant explosion with a circular range.",
        "Data Mascheny Dashes forward with her lance to deal 400% of her ATK as DMG to all enemies in her path and then returns to her starting position. Data Machine is Invincible while Dashing.",
        "Data Mascheny discharges lightning shinsu to deal 400% of her ATK as DMG to nearby enemies. Any enemies she hits are Stunned for 3s. She then creates a Shinsu Barrier that lasts for 10s. Enemies inside the Shinsu Barrier deal 40% less DMG to Data Mascheny. Data Mascheny becomes immune to status effects while using this skill.",
        "Data Mascheny removes all status effects and swallows a Lightning Pill when her HP drops to 40% or below. Upon consuming the Lightning Pill, Data Mascheny gains 100 Lightening Pill Gauge. Lightning Pill's effects are removed when the gauge hits 0. The Lightning Pill Gauge decreases by 10 every second, but increases by 10 whenever Data Machine uses a skill. While the Lightning Pill is active, Data Mascheny's ATK increases by 120% and her HP will not drop below 1."]
    },
    {
        "name": "<span style='color:#F47174'>[Deep-Sea Fish]</span> Hansung Yu",
        "title": "The Eye of the Deep Sea",
        "image": "/images/17.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/red.png",
        "class": "/images/classes/mage.png",
        "type": "/images/types/magic.png",
        "history": "",
        "color": "#F47174",
        "titles": ["Raging Rapids","Endless Sky","Shinsu Cannon Barrage","Rolling Boil"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Hansung Yu summons 3 waves, each dealing 240% of his ATK as DMG to enemies in range and then pushing them away. He decreases the enemy's ATK SPD by 80 and MOVE SPD by 40% for 6s upon landing the skill.",
        "Hansung Yu fire a poweful shinsu cannon to deal 80% of his ATK as DMG to the enemy 10 times, Knocking them Back.",
        "Hansung Yu shoots 8 shinsu cannons at a random enemy, each dealing 120% of his ATK as DMG and jolting them.",
        "When Hansung Yu successfully lands a Critical Hit with a skill, he applies the Rolling Boil effect for 6s. Rolling Boil decreases the target's Magic Resistance by 40%."]
    },
    {
        "name": "<span style='color:#F47174'>[Hellfire]</span> Evankhell",
        "title": "The Burning Asura",
        "image": "/images/18.png",
        "rarity": "/images/rarity/ssrplus.png",
        "element": "/images/elements/red.png",
        "class": "/images/classes/mage.png",
        "type": "/images/types/magic.png",
        "history": "",
        "color": "#F47174",
        "titles": ["Quad Rare Orb-Hellfire","Rare Orb - Festival of Flames","Death Sentence","Ancient Power"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Evankhell summons an orb, dealing 400% of her ATK as DMG to nearby enemies every second for 4s. She deals 600% of her ATK as DMG every second against enemies close to the orb. Evankhell becomes Invincible while using this skill.",
        "Evankhell summons a flame vortex for 3s, which pulls enemies in range and deals 200% of her ATK as DMG. The vortex eventually explodes and deals 400% of her ATK as DMG, Knocking them Down for 2s.",
        "Evankhell uses powerful flames to deal 400% of her ATK as DMG to the enemy with the lowest DEF. In addition, Evankhell recovers HP equal to 30% of the DMG dealt. Evankhell becomes Immune to status effects while using this skill.",
        "Evankhell decreases the HP Recovery amount of her target by 50% for 5s. She unleashes her Ancient Power when her HP drops to 30% or below. (Limit: once). Ancient Power deals 200% of her ATK as DMG to all enemies and recovers 64% of her missing HP. In addition, it increases her ATK by 80% for 15s."]
    },
    {
        "name": "<span style='color:#EEEE9B'>[Fast Ship]</span> Evan",
        "title": "The Guide of the Crossroads",
        "image": "/images/19.png",
        "rarity": "/images/rarity/ssrplus.png",
        "element": "/images/elements/yellow.png",
        "class": "/images/classes/support.png",
        "type": "/images/types/magic.png",
        "history": "",
        "color": "#EEEE9B",
        "titles": ["Restoration","Destructive Urge","Hunger","Adam's Glove"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Evan activates the Frog Fisher's Restoration ability to make all of his allies Immortal for 6s. Immortal allies' HP cannot drop below 10%. Once Immortality is removed, HP is restored by 50% of DMG taken while it was active plus 200% of Evan's ATK.",
        "Evan recovers 200 Energy, then deals 200% of his ATK as DMG to enemies in a straight line, Knocking them Back.",
        "Evan recovers 200 Energy, then removes debuffs from all allies. 25 additional Energy is restored for each debuff removed (up to 10). In addition, allies who no longer have debuffs recover HP equal to 200% of Evan's ATK.",
        "Evan Conceals the ally with the highest ATK at the start of the battle for 2s and restores 200 of their Energy when they are Revealed. In addition, Evan Conceals himself for 2s if his HP drops below 30%. Upon being Revealed, he recovers 200 Energy and HP equal to 600% of his ATK."]
    },
    {
        "name": "<span style='color:#ACD1AF'>[Data]</span> Zahard",
        "title": "The One Who is Destined to be King",
        "image": "/images/20.png",
        "rarity": "/images/rarity/ssrplus.png",
        "element": "/images/elements/green.png",
        "class": "/images/classes/warrior.png",
        "type": "/images/types/physical.png",
        "history": "",
        "color": "#ACD1AF",
        "titles": ["Lecalicus","Golden Needle","Black-Hole Sphere","Needle of War"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["[Tier 1] Lecalicus: Lecalicus bites into the enemy 2 times to deal 400% of Data Zahard's ATK as DMG per hit, applying Bleed to enemies hit for 10s and Knocking them Down for 2s. Bleeding targets take 40% of his ATK as DMG every second.<br><br> [Tier 2] Coelacanth: Coelacanth pierces the enemy, decreasing their DEF by 30% for 10s. Coelacanths piercing attack deals 600% of his ATK as DMG to the target, Bleeding them for 10s and Knocking them Down for 2s. Bleeding targets take 62% of his ATK as DMG every second (does not stack).<br><br>[Tier 3] Leviathan: Data Zahard Teleports to the rear and unleashes Leviathan towards the center of the map. The explosion deals 800% of his ATK as DMG to enemies in range, Burning them for 10s. Burned targets take 80% of his ATK as DMG every second. It then decreases the DEF of targets hit by 30% for 10s and Knocks Down everyone except for Data Zahard for 1s. Data Zahard becomes Invincible while using all Special Moves.",
        "Data Zahard's EVA increases by 200 for 10s. Upon evading, Data Zahard counters his attacker with his Golden Needle. The Golden Needle deals 200% of his ATK as DMG to the target 3 times and Jolts them. Every 10th counterattack enhances the Golden Needle, dealing 400% of his ATK as DMG to enemies near the target and Stunning them for 2s.",
        "Data Zahard's Magic Resistance increases by 40% for 10s when using the power of Black-Hole Sphere. The Black-Hole Sphere creates an explosion, dealing 600% of his ATK as DMG to nearby enemies, Knocking them Back, then Silencing them for 3s.",
        "Data Zahard's weapon transforms according to his remaining HP. For 3s while the weapon is transforming, Data Zahard becomes invincible, and the weapon does not revert to its previous form.<br><br>[Tier 1] Lecalicus (Above 60% HP): Deals 2x DMG to barriers when using basic attacks or Special Move.<br><br>[Tier 2] Coelacanth (60% HP or below - Above 30% HP): Instantly destroys barriers when using basic attacks or Special Move.<br><br>[Tier 3] Leviathan (30% HP or below): Instantly destroys barriers when using basic attacks or Special Move, then deals 80% of the destroyed barrier as additional DMG to the target. (Additional DMG cap - 1,000% of caster's ATK)"]
    },
    {
        "name": "<span style='color:#93CAED'>[Black Fish]</span> Quant",
        "title": "The Fowler in the Dark",
        "image": "/images/21.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/blue.png",
        "class": "/images/classes/assassin.png",
        "type": "/images/types/physical.png",
        "history": "",
        "color": "#93CAED",
        "titles": ["Swift Strike","Dark Area","Reverse Flow Control Dash","Black Fish"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Quant randomly ambushes enemies in range 8 times, dealing 200% of his ATK as DMG each time. Quant prioritizes attacking targets that haven't been ambushed yet. Quant's ATK increases by 50% against targets that have already been ambushed. Quant becomes Invincible while using this skill.",
        "Quant jumps towards the enemy to deal 400% of his ATK as DMG. He creates a Dark Area lasting for 10s. Quant's Swiftness increases by 40 and the enemy's ACC decreases by 40% while in the Dark Area.",
        "Quant dashes towards the enemy with the lowest HP and deals 400% of his ATK as DMG. He then dashes towards a random enemy to deal 400% of his ATK as DMG. While doing so, he Jolts all enemies in his path.",
        "Quant blocks the light with shinsu every 10s, applying Black Fish for 4s. His EVA increases by 120 while Black Fish is active."]
    },
    {
        "name": "<span style='color:#93CAED'>[Wings of Destruction]</span> Horyang Kang",
        "title": "The Devil's Right Arm",
        "image": "/images/22.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/blue.png",
        "class": "/images/classes/tank.png",
        "type": "/images/types/physical.png",
        "history": "",
        "color": "#93CAED",
        "titles": ["Transform Wing: Shield","Indomitable Will","Living Ignition Weapon","Awakened Devil"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Horyang dashes to the ally with the lowest HP, Knocking Back all enemies he collides with. When he arrives near the ally, he creates a barrier for that ally and himself equal to 1,600% of his ATK, lasting 10s, then Provokes nearby enemies for 10s. Horyang gains Status Effect immunity while Dashing.",
        "Horyang gains Status Effect Immunity and increases Physical and Magic Resistance by 80% for 16s.",
        "Horyang releases a wave of power, Paralyzing nearby enemies for 2s and strengthening his right arm. He uses his strengthened right arm in the next basic attack to deal 380% of his ATK as DMG 3 times in a row to enemies in a fan-shaped area, Stunning them for 1s.",
        "Horyang decreases the enemy's ATK by 4% for 5s when attacking them. (Max: 5 stacks)"]
    },
    {
        "name": "<span style='color:#F47174'>[Black Horn]</span> Arkraptor",
        "title": "The Impartial Umbrella",
        "image": "/images/23.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/red.png",
        "class": "/images/classes/ranged.png",
        "type": "/images/types/physical.png",
        "history": "",
        "color": "#F47174",
        "titles": ["Crowd Control","Multi-Purpose Umbrella","Lightning Rod","Arkraptor Style: Shinsu Control"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Arkraptor becomes immune to Jolt and gathers shinsu at the tip of his umbrella. He then shoots in a straight line to deal 200% of his ATK as DMG 6 times. The enemy hit by the last attack is Knocked Back.",
        "Arkraptor opens his umbrella and stands in place for 5s, increasing his forward-facing Physical and Magic Resistance by 80%. He cannot move while his umbrella is open, but he becomes immune to jolt, and the ATK coefficient of his basic attacks is increased by 160%.",
        "Arkraptor points the umbrella at the sky to absorb lightning shinsu, increasing his ATK by 24% and Critical Hit Rate by 24% for 10s.",
        "Arkraptor's basic attacks pierce targets, Arkraptor's Swiftness does not fluctuate, but his ATK fluctuates by 2% for every point of Swiftness Fluctuation."]
    },
    {
        "name": "<span style='color:##ACD1AF'>[Blooming Flower]</span> Miseng Yeo",
        "title": "The Diligent Spirit",
        "image": "/images/24.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/green.png",
        "class": "/images/classes/warrior.png",
        "type": "/images/types/physical.png",
        "history": "",
        "color": "#ACD1AF",
        "titles": ["Berserker Mode","Small & Spicy Fists","Reflection","Time to Fight"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Miseng gains Status Effect Immunity for 10s while Berserker Mode is active. In addition, her ATK increases by 80% and her Swiftness increases by 80.",
        "Miseng pummels the enemy with a barrage of fists, dealing 160% of her ATK as DMG 8 times and jolting them.",
        "Miseng activates Observer Reflection Mode for 10s to increase her Ranged DMG Resistance by 80%. While this mode is active, 400% of the Ranged DMG Miseng takes is reflected back to the enemy. (Reflect DMG Limit - 500% of caster's ATK)",
        "Missing dashes towards the enemy at the start of the battle to deal 620% of her ATK as DMG, Stunning them for 3s. She then attacks one more time to deal 400% of her ATK as additional DMG."]
    },
    {
        "name": "<span style='color:#B695C0'>[Bora Bora]</span> Prince",
        "title": "The Young Master of Ego",
        "image": "/images/25.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/purple.png",
        "class": "/images/classes/warrior.png",
        "type": "/images/types/magic.png",
        "history": "",
        "color": "#B695C0",
        "titles": ["Triple Field","Splatter","Bora Bora Catch","New Prince Mode"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Prince deploys a Triple Field around himself for 7s, dealing 620% of his ATK as DMG and decreasing the Swiftness of enemies in range by 48. When the Triple Field disappears, his Lighthouse explodes to deal 620% of his ATK as DMG to enemies in range, Jolting them.",
        "Prince gathers shinsu in a needle and stabs the enemy. A shinsu whirlwind forms in the same direction, dealing 400% of his ATK as DMG to enemies in a straight line, then decreasing their Magic Resistance by 48% for 8s.",
        "Prince summons a reel and Locks nearby enemeies for 4s, dealing 360% of his ATK as DMG , then decreasing their Magic Resistance by 48% for 12s.",
        "Prince gets fired up when his HP drops to 30% or below, removing debuffs and status effects, and activating New Prince Mode for 10s. New Prince Mode increases his DEF by 200% and his ATK by 200%. (Limit: once)"]
    },
    {
        "name": "<span style='color:#93CAED'>[Gamer]</span> Khun Hatzling",
        "title": "The Undisputed No. 1",
        "image": "/images/26.png",
        "rarity": "/images/rarity/ssr.png",
        "element": "/images/elements/blue.png",
        "class": "/images/classes/ranged.png",
        "type": "/images/types/magic.png",
        "history": "",
        "color": "#93CAED",
        "titles": ["Star of Death","Exploit","Lighthouse Modification","Blueberry 13"],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["Hatzling summons a Star of Death in the sky, dealing 400% of his ATK as DMG 4 times to the enemy with the lowest HP and nearby enemies, as well as Jolting them. Hatzling's Swiftness increases by 50 for 5s if the enemy is defeated by the attack. Hatzling becomes Invincible while using this skill.",
        "Hatzling draws a spear and throws it at the enemy to deal 400% of his ATK as DMG, decreasing their DEF by 40% for 6s. The spear then explodes with shinsu to deal 400% of his ATK as DMG to nearby enemies.",
        "Hatzling borrows someone else's Lighthouse to extend his attack range for 8s. This skill increases Hatzling's Basic Attack DMG by 120%. While active, his basic attacks cause explosions that damage enemies near his target.",
        "Hatzling gains combo stacks upon attacking the enemy. Every 10 combo hits, Hatzling recovers Energy equal to 20 times the number of combo hits, and his Special Move's ATK coefficient increases by 100%. The combo effect increases up to 40 combo hits. The combo resets if it isn't renewed within 8s or if hit by status effect ATK."]
    },
    {
        "name": "",
        "title": "",
        "image": "",
        "rarity": "",
        "element": "",
        "class": "",
        "type": "",
        "history": "",
        "color": "",
        "titles": ["","","",""],
        "types": ["Special Move", "Active", "Active", "Passive"],
        "descriptions": ["",
        "",
        "",
        ""]
    }
]